# BuiltInFailures.PropertySetElementFailures Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..PropertySetElementFailures Properties
BuiltInFailures..::..PropertySetElementFailures Class See Also
---
The BuiltInFailures..::..PropertySetElementFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EmptyPropertySetName | A property set name cannot be an empty string. |
| NonStringParameterValue | The given parameter requires a string value. |
| NonUniquePropertySetName | The value of the given parameter is already in use as a property set name. |

# See Also
BuiltInFailures..::..PropertySetElementFailures Class
Autodesk.Revit.DB Namespace